Catalogs/Д_ШаблоныДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Д_ШаблоныДоговоров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СодержаниеДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипРаздела</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстФорматированный</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстHTML</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствиеПеременных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПеременной</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПеременной</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расшифровка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтаПредопределеннаяПеременная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Д_ШаблоныДоговоров/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.Д_ШаблоныДоговоров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Д_ШаблоныДоговоров.Преамбула,
	|	Д_ШаблоныДоговоров.СодержаниеДоговора.(
	|		Номер,
	|		Текст,
	|		ТипРаздела
	|	),
	|	Д_ШаблоныДоговоров.СтороныДоговора.(
	|		Ссылка,
	|		НомерСтроки,
	|		Сторона
	|	),
	|	Д_ШаблоныДоговоров.ГородДоговора,
	|	Д_ШаблоныДоговоров.ШапкаДоговора
	|ИЗ
	|	Справочник.Д_ШаблоныДоговоров КАК Д_ШаблоныДоговоров
	|ГДЕ
	|	Д_ШаблоныДоговоров.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСодержаниеДоговораШапка = Макет.ПолучитьОбласть("СодержаниеДоговораШапка");
	ОбластьСодержаниеДоговораПункт = Макет.ПолучитьОбласть("СодержаниеДоговораПункт");
	ОбластьСодержаниеДоговораРаздел = Макет.ПолучитьОбласть("СодержаниеДоговораРаздел");
	ОбластьСтороныДоговораШапка  = Макет.ПолучитьОбласть("СтороныДоговораШапка");
	ОбластьСтороныДоговора = Макет.ПолучитьОбласть("СтороныДоговора");
	ОбластьГородДата = Макет.ПолучитьОбласть("ГородДата");
	ОбластьПреамбула = Макет.ПолучитьОбласть("Преамбула");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ОбластьГородДата.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьГородДата, Выборка.Уровень());
		
		ОбластьПреамбула.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПреамбула, Выборка.Уровень());
		
		
		ТабДок.Вывести(ОбластьСодержаниеДоговораШапка);
		ВыборкаСодержаниеДоговора = Выборка.СодержаниеДоговора.Выбрать();
		Пока ВыборкаСодержаниеДоговора.Следующий() Цикл
			Если ВыборкаСодержаниеДоговора.ТипРаздела = "Раздел" Тогда
				ОбластьСодержаниеДоговораРаздел.Параметры.Заполнить(ВыборкаСодержаниеДоговора);
				ТабДок.Вывести(ОбластьСодержаниеДоговораРаздел, ВыборкаСодержаниеДоговора.Уровень());
			Иначе
				ОбластьСодержаниеДоговораПункт.Параметры.Заполнить(ВыборкаСодержаниеДоговора);
				ТабДок.Вывести(ОбластьСодержаниеДоговораПункт, ВыборкаСодержаниеДоговора.Уровень());
			КонецЕсли;
		КонецЦикла;

		ТабДок.Вывести(ОбластьСтороныДоговораШапка);
		ВыборкаСтороныДоговора = Выборка.СтороныДоговора.Выбрать();
		Пока ВыборкаСтороныДоговора.Следующий() Цикл
			ОбластьСтороныДоговора.Параметры.Заполнить(ВыборкаСтороныДоговора);
			ТабДок.Вывести(ОбластьСтороныДоговора, ВыборкаСтороныДоговора.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
